<div class="container py-5 mt-5">
  <div class="row align-items-center">
    <div class="col-4 col-lg-5 text-center px-0 px-lg-3">
      <div class="gruzchiki_image">
        <img src="#" data-src="/assets/landing/img/Koronavirus.svg" alt="Грузчики на погрузку">
      </div>
    </div>
    <div class="col-8 col-lg-6">
      <div class="gruzchiki_text">

      <p>Несмотря на неблагоприятную эпидемиологическую обстановку, «Транспортная компания ПраймТранс» продолжает свою работу. Из-за карантина все сотрудники офиса нашей компании переведены на удаленный режим работы.
        </p>
        <p>
        Федеральная власть, областные и муниципальные администрации ежедневно принимают законы и поправки по ограничениям и запрещениям на передвижение автомобильного транспорта по различным территориям нашей страны.
        Специально для вас ежедневно мы будем мониторить информацию, связанную с передвижением грузового автомобильного транспорта, опираясь исключительно на официальные данные и источники.
      </p>
      <p>
      Наша компания осуществляет перевозки грузов между теми городами России, которые по официальным данным не закрыты для транзита или въезда и выезда.
      Всю актуальную информацию вы можете найти  в нашей официальной группе вконтакте.
      Эта информация поможет Вам понять, стоит ли перевозить Ваши вещи или стоит немного подождать.
      </p>
      <p>
      </div>
    </div>
    <div class="col-lg-6 offset-lg-6 offset-md-4">
      <div class="text-center py-3">
        <a href="https://vk.com/prtransru" class="btn btn-primary" target="_blank">Следить за новостями в VK</a>
      </div>
    </div>
  </div>
</div>
