<?php
// Подключаем MODX
define('MODX_API_MODE', true);
require  '/var/www/prtrans/data/www/dev.prtrans.ru/index.php';

// Включаем обработку ошибок MODXurl
$modx->getService('error','error.modError');
$modx->setLogLevel(modX::LOG_LEVEL_INFO);
$modx->switchContext('web');
$pdo = $modx->getService('pdoFetch');

function marzha($p){
  if($p > 100000){
    return 13000;
  }elseif($p > 50000){
    return 9000;
  }elseif($p > 20000){
    return 8000;
  }else{
    return 6000;
  }
}

//Получаем мини-города из таблицы Для Краснодара
$generator = $modx->newObject('modResource');

$prCities = $modx->getService('prCities', 'prCities', MODX_CORE_PATH . 'components/prcities/model/');
/*
foreach ($cities as $key => $city) {
    if(!$city['url']){
      $doc = $modx->getObject('prCitiesItem', $city['id']);
      $doc->set('url', $generator->cleanAlias($city['from'] .'-'. $city['to']));
      $doc->save();
    }
}
*/


$ids = array(
  116680,
  117434,
  283340,
  263871,
  118140,
  120426,
  121188,
  267903,
  267141,
  264688,
  269513,
  125760,
  205549,
  206266,
  206983,
  207700,
  208417,
  209943,
  132562,
  209226,
  213179,
  219944,
  220753,
  224614,
  235183,
  238235,
  243438,
  245773,
  133324,
  134792,
  135554,
  210752,
  228419,
  263053,
  260787,
  139504,
  211561,
  212370,
  274342,
  260026,
  213896,
  214613,
  215274,
  216083,
  216800,
  146340,
  82468,
  217609,
  265506,
  218418,
  147102,
  148685,
  219135,
  149447,
  136316,
  161757,
  151030,
  152554,
  222279,
  223088,
  223805,
  226084,
  226801,
  227610,
  160233,
  83746,
  229136,
  229853,
  123474,
  124236,
  275978,
  270331,
  277614,
  280068,
  289066,
  141768,
  287430,
  292338,
  272785,
  282522,
  285794,
  284158,
  157185,
  280886,
  290702,
  276796,
  289884,
  281704,
  271149,
  284976,
  275160,
  271967,
  231470,
  232187,
  232904,
  129570,
  141006,
  221562,
  225423,
  230661,
  240478,
  115178,
  244964,
  115918,
  95167,
  233565,
  234374,
  85024,
  266323,
  204816,
  205172,
  235900,
  258511,
  122712,
  124998,
  286612,
  130332,
  131856,
  137078,
  142530,
  278432,
  157947,
  288248,
  291520,
  105953,
  293156,
  236617,
  237426,
  259239,
  98977,
  238952,
  239669,
  84385,
  83107,
  118902,
  119664,
  121950,
  126522,
  127284,
  128046,
  128808,
  131094,
  134086,
  137840,
  138683,
  140244,
  143292,
  144054,
  144816,
  145578,
  147945,
  150290,
  151792,
  154159,
  154899,
  155661,
  156423,
  158709,
  159471,
  160995,
  87429,
  88191,
  88953,
  89796,
  90536,
  91379,
  92119,
  92881,
  93643,
  94405,
  95929,
  96691,
  97453,
  98215,
  99739,
  100501,
  101263,
  102106,
  102846,
  103608,
  104370,
  105213,
  106715,
  107477,
  112049,
  113573,
  279250,
  268695,
  241195,
  108239,
  109001,
  241912,
  109763,
  242629,
  110525,
  111287,
  262258,
  112811,
  114335,
  153316,
  244155,
  273547,
  261525,


 );
foreach ($ids as $key => $id) {
  if($key % 2){
    $doc = $modx->getObject('prCitiesItem', $id);
    $doc->set('to', 'Краснослободск Республика Мордовия');
    $doc->save();

  }else{
    $doc = $modx->getObject('prCitiesItem', $id);
    $doc->set('to', 'Краснослободск Волгоградская область');
    $doc->set('url', $generator->cleanAlias($doc->get('from') .'-Краснослободск Волгоградская область'));
    $doc->save();
  }

}
